In [10]:
import pandas as pd

In [11]:
pd.options.display.max_columns = 6

In [15]:
df = pd.read_csv('https://sololearn.com/uploads/files/titanic.csv')

In [16]:
df

,Survived,Pclass,Sex,...,Siblings/Spouses,Parents/Children,Fare
0,0,3,male,...,1,0,7.2500
1,1,1,female,...,1,0,71.2833
2,1,3,female,...,0,0,7.9250
3,1,1,female,...,1,0,53.1000
4,0,3,male,...,0,0,8.0500
...,...,...,...,...,...,...,...
882,0,2,male,...,0,0,13.0000
883,1,1,female,...,0,0,30.0000
884,0,3,female,...,1,2,23.4500
885,1,1,male,...,0,0,30.0000
886,0,3,male,...,0,0,7.7500

In [17]:
print(df.head())

   Survived  Pclass     Sex  ...  Siblings/Spouses  Parents/Children     Fare
0         0       3    male  ...                 1                 0   7.2500
1         1       1  female  ...                 1                 0  71.2833
2         1       3  female  ...                 0                 0   7.9250
3         1       1  female  ...                 1                 0  53.1000
4         0       3    male  ...                 0                 0   8.0500

[5 rows x 7 columns]

In [18]:
print(df.describe())

         Survived      Pclass         Age  Siblings/Spouses  Parents/Children  \
count  887.000000  887.000000  887.000000        887.000000        887.000000
mean     0.385569    2.305524   29.471443          0.525366          0.383315
std      0.487004    0.836662   14.121908          1.104669          0.807466
min      0.000000    1.000000    0.420000          0.000000          0.000000
25%      0.000000    2.000000   20.250000          0.000000          0.000000
50%      0.000000    3.000000   28.000000          0.000000          0.000000
75%      1.000000    3.000000   38.000000          1.000000          0.000000
max      1.000000    3.000000   80.000000          8.000000          6.000000

            Fare
count  887.00000
mean    32.30542
std     49.78204
min      0.00000
25%      7.92500
50%     14.45420
75%     31.13750
max    512.32920

In [19]:
col = df['Fare']

In [20]:
col

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
882    13.0000
883    30.0000
884    23.4500
885    30.0000
886     7.7500
Name: Fare, Length: 887, dtype: float64

In [21]:
small_df = df[['Age', 'Survived', 'Sex']]

In [22]:
small_df.head()

    Age  Survived     Sex
0  22.0         0    male
1  38.0         1  female
2  26.0         1  female
3  35.0         1  female
4  35.0         0    male

In [23]:
df['male']  = df['Sex']=='male'#creating a new column that stores True if 'male' and False is 'Female'

In [24]:
df.head()

   Survived  Pclass     Sex  ...  Parents/Children     Fare   male
0         0       3    male  ...                 0   7.2500   True
1         1       1  female  ...                 0  71.2833  False
2         1       3  female  ...                 0   7.9250  False
3         1       1  female  ...                 0  53.1000  False
4         0       3    male  ...                 0   8.0500   True

[5 rows x 8 columns]